FROM node

WORKDIR /app

COPY . ./

RUN npm install

# 80번 포트를 열어준다.
# 이렇게 하면 외부에서 컨테이너로 들어오는 요청을 받을 수 있다.
# 이렇게 포트를 열어주지 않으면 외부에서 컨테이너로 들어오는 요청을 받을 수 없다.
EXPOSE 80

CMD ["node", "server.js"]

# FROM은 어떤 이미지를 기반으로 할지 정하는 명령어
# WORKDIR은 명령어가 실행될 디렉토리를 설정하는 명령어
# COPY는 로컬 파일을 컨테이너에 복사하는 명령어
# RUN은 이미지를 생성될 때 실행할 명령어
# EXPOSE는 컨테이너가 실행될 때 사용할 포트를 설정하는 명령어 (외부에서 접근할 수 있도록 포트를 열어준다.)
# CMD는 컨테이너가 시작되었을 때 실행할 명령어

# > docker build .
# > docker run -p <외부포트>:<내부포트> <이미지ID>

# -p 옵션을 사용하면 외부 포트와 내부 포트를 연결할 수 있다. (포트 포워딩)

# 이미지는 읽기 전용이다. 이미지를 실행하면 컨테이너가 생성되고, 컨테이너는 읽기/쓰기가 가능하다.